rails_tryout_pb/app/controllers/homework_controller.rb

  def start
  	@homework = Homework.find(params[:id])

  	@question = @homework.questions.first
  	@answers	= @question.answers
  	@solution = @question.answer

  	render plain: "#{@question.id} --- #{@answers.to_a.map { |e| e.id }.join(',')} --- #{@solution.id}"
---
SELECT  "homework".* FROM "homework" WHERE "homework"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."homework_id" = $1  ORDER BY "questions"."id" ASC LIMIT 1  [["homework_id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 1]]

  def next
  	@homework = Homework.find(params[:id])
  	@question = Question.find(params[:question_id])
---
SELECT  "homework".* FROM "homework" WHERE "homework"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."homework_id" = $1  [["homework_id", 1]]