rails_tryout_pb/app/controllers/news_controller.rb

SELECT "news".* FROM "news"
---
  def index
  	authorize News

    @news = News.all

SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @news = News.find(params[:id])